diffusor-mesh/ind1/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0.01;

boundaryField
{

    inlet
    {
        type            calculated;
        value           uniform 0.01;
    }
    outlet
    {
        type            calculated;
        value           uniform 0.01;
    }
    compressor
    {
        type            calculated;
        value           uniform 0.01;
    }
    upper
    {
        type            calculated;
        value           uniform 0.01;
    }
    lower
    {
        type            calculated;
        value           uniform 0.01;
    }
    cowl    
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           uniform 0.01;
    }
	axis    
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           uniform 0.01;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
